export default [
    {
        title: '前置问题',
        text: [
            '简单的做个自我介绍',
            '简单的介绍一下你的项目',
            '之前的工作主要做一些什么',
        ]
    },
    {
        title: 'HTML押题',
        random: 2,
        text: [
            '你是如何理解HTML语义化的？（举例）',
            'meta viewport 是做什么的，怎么写？（举例）',
            '你用过哪些HTML5标签（举例）',
            'H5是什么（概念）'
        ]
    },
    {
        title: 'CSS押题',
        random: 2,
        text: [
            '两种盒模型分别说一下。',
            '如何垂直居中？',
            'flex 怎么用，常用属性有哪些？',
            'BFC 是什么？',
            'CSS 选择器优先级？',
            '如何清除浮动？'
        ]
    },
    {
        title: 'JS押题',
        random: 5,
        text: [
            'ES 6 语法知道哪些，分别怎么用？',
            'Promise、Promise.all、Promise.race 分别怎么用？',
            '手写函数防抖和函数节流',
            '手写AJAX',
            '这段代码里的 this 是什么？',
            '闭包/立即执行函数是什么？',
            '什么是 JSONP，什么是 CORS，什么是跨域？',
            'async/await 怎么用，如何捕获异常？',
            '如何实现深拷贝？',
            '如何用正则实现 trim()？',
            '不用 class 如何实现继承？用 class 又如何实现？',
            '如何实现数组去重？',
            '手写一个 Promise'
        ]
    },
    {
        title: 'Vue押题',
        random: 2,
        text: [
            'watch 和 computed 和 methods 区别是什么？',
            'Vue 有哪些生命周期钩子函数？分别有什么用？',
            'Vue 如何实现组件间通信？',
            'Vue 数据响应式怎么做到的？（双向绑定的原理）',
            'Vue.set 是做什么用的？',
            'Vuex 的用法？',
            'VueRouter 的用法？',
            '路由守卫是什么？',
        ]
    },
    {
        title: '开放性问题',
        random: 2,
        text: [
            '说说你对行业、技术发展趋势的看法。',
            '说说你在工作中遇到的最难的问题，以及你是如何解决该问题的。',
            '为什么从上一家公司离职？',
            '你最近是否参加了培训课程。',
            '你还有什么问题要问的吗。'
        ]
    },
]